Revit 2027 API
HostObject.FindInserts Method
 Gets the ids of the instances inserted into this host object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> FindInserts(
	bool addRectOpenings,
	bool includeShadows,
	bool includeEmbeddedWalls,
	bool includeSharedEmbeddedInserts
)
Public Function FindInserts (
	addRectOpenings As Boolean,
	includeShadows As Boolean,
	includeEmbeddedWalls As Boolean,
	includeSharedEmbeddedInserts As Boolean
) As IList(Of ElementId)
public:
IList<ElementId^>^ FindInserts(
	bool addRectOpenings,
	bool includeShadows,
	bool includeEmbeddedWalls,
	bool includeSharedEmbeddedInserts
)
member FindInserts :
        addRectOpenings : bool *
        includeShadows : bool *
        includeEmbeddedWalls : bool *
        includeSharedEmbeddedInserts : bool -> IList<ElementId>
Parameters
addRectOpenings Boolean
 True if rectangular openings should be included in the return.
includeShadows Boolean
 True if shadows should be included in the return.
includeEmbeddedWalls Boolean
 True if embedded walls should be included in the return.
includeSharedEmbeddedInserts Boolean
 True if shared embedded inserts should be included in the return.
Return Value
IList<ElementId>
 All the insertable instances' ids.
See Also
Reference
HostObject Class
Autodesk.Revit.DB Namespace